app/views/books/home.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
<% if logged_in? %>
    <h1>Hello <%= Guser.find_by_id(session[:guser_id]).name%></h1>